{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 💡 Solutions\n",
    "\n",
    "Before trying out these solutions, please start the [gqlalchemy-workshop notebook](../workshop/gqlalchemy-workshop.ipynb) to import all data. Also, this solutions manual is here to help you out, and it is recommended you try solving the exercises first by yourself.\n",
    "\n",
    "## Exercise 1\n",
    "\n",
    "**Find out how many genres there are in the database.**\n",
    "\n",
    "The correct Cypher query is:\n",
    "\n",
    "```\n",
    "MATCH (g:Genre)\n",
    "RETURN count(g) AS num_of_genres;\n",
    "```\n",
    "\n",
    "You can try it out in Memgraph Lab at `localhost:3000`.\n",
    "\n",
    "With GQLAlchemy's query builder, the solution is:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "22084\n"
     ]
    }
   ],
   "source": [
    "from gqlalchemy import match\n",
    "\n",
    "total_genres = (\n",
    "    match()\n",
    "    .node(labels=\"Genre\", variable=\"g\")\n",
    "    .return_({\"count(g)\": \"num_of_genres\"})\n",
    "    .execute()\n",
    ")\n",
    "\n",
    "results = list(total_genres)\n",
    "for result in results:\n",
    "    print(result[\"num_of_genres\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Exercise 2\n",
    "\n",
    "**Find out to how many genres movie 'Matrix, The (1999)' belongs to.**\n",
    "\n",
    "\n",
    "The correct Cypher query is:\n",
    "\n",
    "```\n",
    "MATCH (:Movie {title: 'Matrix, The (1999)'})-[:OF_GENRE]->(g:Genre)\n",
    "RETURN count(g) AS num_of_genres;\n",
    "```\n",
    "\n",
    "You can try it out in Memgraph Lab at `localhost:3000`.\n",
    "\n",
    "With GQLAlchemy's query builder, the solution is:\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "matrix = (\n",
    "    match()\n",
    "    .node(labels=\"Movie\", variable=\"m\")\n",
    "    .to(\"OF_GENRE\")\n",
    "    .node(labels=\"Genre\", variable=\"g\")\n",
    "    .where(\"m.title\", \"=\", \"Matrix, The (1999)\")\n",
    "    .return_({\"count(g)\": \"num_of_genres\"})\n",
    "    .execute()\n",
    ")\n",
    "\n",
    "results = list(matrix)\n",
    "\n",
    "for result in results:\n",
    "    print(result[\"num_of_genres\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Exercise 3\n",
    "\n",
    "**Find out the title of the movies that the user with `id` 1 rated.**\n",
    "\n",
    "\n",
    "The correct Cypher query is:\n",
    "\n",
    "```\n",
    "MATCH (:User {id: 1})-[:RATED]->(m:Movie)\n",
    "RETURN m.title;\n",
    "```\n",
    "\n",
    "You can try it out in Memgraph Lab at `localhost:3000`.\n",
    "\n",
    "With GQLAlchemy's query builder, the solution is:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Toy Story (1995)\n",
      "Grumpier Old Men (1995)\n",
      "Heat (1995)\n",
      "Seven (a.k.a. Se7en) (1995)\n",
      "Usual Suspects, The (1995)\n",
      "From Dusk Till Dawn (1996)\n",
      "Bottle Rocket (1996)\n",
      "Braveheart (1995)\n",
      "Rob Roy (1995)\n",
      "Canadian Bacon (1995)\n",
      "Desperado (1995)\n",
      "Billy Madison (1995)\n",
      "Clerks (1994)\n",
      "Dumb & Dumber (Dumb and Dumber) (1994)\n",
      "Ed Wood (1994)\n",
      "Star Wars: Episode IV - A New Hope (1977)\n",
      "Pulp Fiction (1994)\n",
      "Stargate (1994)\n",
      "Tommy Boy (1995)\n",
      "Clear and Present Danger (1994)\n",
      "Forrest Gump (1994)\n",
      "Jungle Book, The (1994)\n",
      "Mask, The (1994)\n",
      "Blown Away (1994)\n",
      "Dazed and Confused (1993)\n",
      "Fugitive, The (1993)\n",
      "Jurassic Park (1993)\n",
      "Mrs. Doubtfire (1993)\n",
      "Schindler's List (1993)\n",
      "So I Married an Axe Murderer (1993)\n",
      "Three Musketeers, The (1993)\n",
      "Tombstone (1993)\n",
      "Dances with Wolves (1990)\n",
      "Batman (1989)\n",
      "Silence of the Lambs, The (1991)\n",
      "Pinocchio (1940)\n",
      "Fargo (1996)\n",
      "Mission: Impossible (1996)\n",
      "James and the Giant Peach (1996)\n",
      "Space Jam (1996)\n",
      "Rock, The (1996)\n",
      "Twister (1996)\n",
      "Independence Day (a.k.a. ID4) (1996)\n",
      "She's the One (1996)\n",
      "Wizard of Oz, The (1939)\n",
      "Citizen Kane (1941)\n",
      "Adventures of Robin Hood, The (1938)\n",
      "Ghost and Mrs. Muir, The (1947)\n",
      "Mr. Smith Goes to Washington (1939)\n",
      "Escape to Witch Mountain (1975)\n",
      "Winnie the Pooh and the Blustery Day (1968)\n",
      "Three Caballeros, The (1945)\n",
      "Sword in the Stone, The (1963)\n",
      "Dumbo (1941)\n",
      "Pete's Dragon (1977)\n",
      "Bedknobs and Broomsticks (1971)\n",
      "Alice in Wonderland (1951)\n",
      "That Thing You Do! (1996)\n",
      "Ghost and the Darkness, The (1996)\n",
      "Swingers (1996)\n",
      "Willy Wonka & the Chocolate Factory (1971)\n",
      "Monty Python's Life of Brian (1979)\n",
      "Reservoir Dogs (1992)\n",
      "Platoon (1986)\n",
      "Basic Instinct (1992)\n",
      "E.T. the Extra-Terrestrial (1982)\n",
      "Abyss, The (1989)\n",
      "Monty Python and the Holy Grail (1975)\n",
      "Star Wars: Episode V - The Empire Strikes Back (1980)\n",
      "Princess Bride, The (1987)\n",
      "Raiders of the Lost Ark (Indiana Jones and the Raiders of the Lost Ark) (1981)\n",
      "Clockwork Orange, A (1971)\n",
      "Apocalypse Now (1979)\n",
      "Star Wars: Episode VI - Return of the Jedi (1983)\n",
      "Goodfellas (1990)\n",
      "Alien (1979)\n",
      "Psycho (1960)\n",
      "Blues Brothers, The (1980)\n",
      "Full Metal Jacket (1987)\n",
      "Henry V (1989)\n",
      "Quiet Man, The (1952)\n",
      "Terminator, The (1984)\n",
      "Duck Soup (1933)\n",
      "Shining, The (1980)\n",
      "Groundhog Day (1993)\n",
      "Back to the Future (1985)\n",
      "Highlander (1986)\n",
      "Young Frankenstein (1974)\n",
      "Fantasia (1940)\n",
      "Indiana Jones and the Last Crusade (1989)\n",
      "Pink Floyd: The Wall (1982)\n",
      "Nosferatu (Nosferatu, eine Symphonie des Grauens) (1922)\n",
      "Batman Returns (1992)\n",
      "Sneakers (1992)\n",
      "Last of the Mohicans, The (1992)\n",
      "McHale's Navy (1997)\n",
      "Best Men (1997)\n",
      "Grosse Pointe Blank (1997)\n",
      "Austin Powers: International Man of Mystery (1997)\n",
      "Con Air (1997)\n",
      "Face/Off (1997)\n",
      "Men in Black (a.k.a. MIB) (1997)\n",
      "Conan the Barbarian (1982)\n",
      "L.A. Confidential (1997)\n",
      "Kiss the Girls (1997)\n",
      "Game, The (1997)\n",
      "I Know What You Did Last Summer (1997)\n",
      "Starship Troopers (1997)\n",
      "Big Lebowski, The (1998)\n",
      "Wedding Singer, The (1998)\n",
      "Welcome to Woop-Woop (1997)\n",
      "Newton Boys, The (1998)\n",
      "Wild Things (1998)\n",
      "Small Soldiers (1998)\n",
      "All Quiet on the Western Front (1930)\n",
      "Rocky (1976)\n",
      "Labyrinth (1986)\n",
      "Lethal Weapon (1987)\n",
      "Goonies, The (1985)\n",
      "Back to the Future Part III (1990)\n",
      "Bambi (1942)\n",
      "Saving Private Ryan (1998)\n",
      "Black Cauldron, The (1985)\n",
      "Flight of the Navigator (1986)\n",
      "Great Mouse Detective, The (1986)\n",
      "Honey, I Shrunk the Kids (1989)\n",
      "Negotiator, The (1998)\n",
      "Jungle Book, The (1967)\n",
      "Rescuers, The (1977)\n",
      "Return to Oz (1985)\n",
      "Rocketeer, The (1991)\n",
      "Sleeping Beauty (1959)\n",
      "Song of the South (1946)\n",
      "Tron (1982)\n",
      "Indiana Jones and the Temple of Doom (1984)\n",
      "Lord of the Rings, The (1978)\n",
      "Charlotte's Web (1973)\n",
      "Secret of NIMH, The (1982)\n",
      "American Tail, An (1986)\n",
      "Legend (1985)\n",
      "NeverEnding Story, The (1984)\n",
      "Beetlejuice (1988)\n",
      "Willow (1988)\n",
      "Toys (1992)\n",
      "Few Good Men, A (1992)\n",
      "Rush Hour (1998)\n",
      "Edward Scissorhands (1990)\n",
      "American History X (1998)\n",
      "I Still Know What You Did Last Summer (1998)\n",
      "Enemy of the State (1998)\n",
      "King Kong (1933)\n",
      "Very Bad Things (1998)\n",
      "Psycho (1998)\n",
      "Rushmore (1998)\n",
      "Romancing the Stone (1984)\n",
      "Young Sherlock Holmes (1985)\n",
      "Thin Red Line, The (1998)\n",
      "Howard the Duck (1986)\n",
      "Texas Chainsaw Massacre, The (1974)\n",
      "Crocodile Dundee (1986)\n",
      "¡Three Amigos! (1986)\n",
      "20 Dates (1998)\n",
      "Office Space (1999)\n",
      "Logan's Run (1976)\n",
      "Planet of the Apes (1968)\n",
      "Lock, Stock & Two Smoking Barrels (1998)\n",
      "Matrix, The (1999)\n",
      "Go (1999)\n",
      "SLC Punk! (1998)\n",
      "Dick Tracy (1990)\n",
      "Mummy, The (1999)\n",
      "Star Wars: Episode I - The Phantom Menace (1999)\n",
      "Superman (1978)\n",
      "Superman II (1980)\n",
      "Dracula (1931)\n",
      "Frankenstein (1931)\n",
      "Wolf Man, The (1941)\n",
      "Rocky Horror Picture Show, The (1975)\n",
      "Run Lola Run (Lola rennt) (1998)\n",
      "South Park: Bigger, Longer and Uncut (1999)\n",
      "Ghostbusters (a.k.a. Ghost Busters) (1984)\n",
      "Iron Giant, The (1999)\n",
      "Big (1988)\n",
      "13th Warrior, The (1999)\n",
      "American Beauty (1999)\n",
      "Excalibur (1981)\n",
      "Gulliver's Travels (1939)\n",
      "Total Recall (1990)\n",
      "Dirty Dozen, The (1967)\n",
      "Goldfinger (1964)\n",
      "From Russia with Love (1963)\n",
      "Dr. No (1962)\n",
      "Fight Club (1999)\n",
      "RoboCop (1987)\n",
      "Who Framed Roger Rabbit? (1988)\n",
      "Live and Let Die (1973)\n",
      "Thunderball (1965)\n",
      "Being John Malkovich (1999)\n",
      "Spaceballs (1987)\n",
      "Robin Hood (1973)\n",
      "Dogma (1999)\n",
      "Messenger: The Story of Joan of Arc, The (1999)\n",
      "Longest Day, The (1962)\n",
      "Green Mile, The (1999)\n",
      "Easy Rider (1969)\n",
      "Talented Mr. Ripley, The (1999)\n",
      "Encino Man (1992)\n",
      "Sister Act (1992)\n",
      "Wayne's World (1992)\n",
      "Scream 3 (2000)\n",
      "JFK (1991)\n",
      "Teenage Mutant Ninja Turtles II: The Secret of the Ooze (1991)\n",
      "Teenage Mutant Ninja Turtles III (1993)\n",
      "Red Dawn (1984)\n",
      "Good Morning, Vietnam (1987)\n",
      "Grumpy Old Men (1993)\n",
      "Ladyhawke (1985)\n",
      "Hook (1991)\n",
      "Predator (1987)\n",
      "Gladiator (2000)\n",
      "Road Trip (2000)\n",
      "Man with the Golden Gun, The (1974)\n",
      "Blazing Saddles (1974)\n",
      "Mad Max (1979)\n",
      "Road Warrior, The (Mad Max 2) (1981)\n",
      "Shaft (1971)\n",
      "Big Trouble in Little China (1986)\n",
      "Shaft (2000)\n",
      "X-Men (2000)\n",
      "What About Bob? (1991)\n",
      "Transformers: The Movie (1986)\n",
      "M*A*S*H (a.k.a. MASH) (1970)\n"
     ]
    }
   ],
   "source": [
    "movies = (\n",
    "    match()\n",
    "    .node(labels=\"User\", variable=\"u\")\n",
    "    .to(\"RATED\")\n",
    "    .node(labels=\"Movie\", variable=\"m\")\n",
    "    .where(\"u.id\", \"=\", 1)\n",
    "    .return_({\"m.title\": \"movie\"})\n",
    "    .execute()\n",
    ")\n",
    "\n",
    "results = list(movies)\n",
    "\n",
    "for result in results:\n",
    "    print(result[\"movie\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Exercise 4\n",
    "\n",
    "**List 15 movies of 'Documentary' and 'Comedy' genres and sort them by title descending.**\n",
    "\n",
    "\n",
    "The correct Cypher query is:\n",
    "\n",
    "```\n",
    "MATCH (m:Movie)-[:OF_GENRE]->(:Genre {name: \"Documentary\"})\n",
    "MATCH (m)-[:OF_GENRE]->(:Genre {name: \"Comedy\"})\n",
    "RETURN m.title\n",
    "ORDER BY m.title DESC\n",
    "LIMIT 15;\n",
    "```\n",
    "\n",
    "You can try it out in Memgraph Lab at `localhost:3000`.\n",
    "\n",
    "With GQLAlchemy's query builder, the solution is:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "What the #$*! Do We Know!? (a.k.a. What the Bleep Do We Know!?) (2004)\n",
      "Union: The Business Behind Getting High, The (2007)\n",
      "Super Size Me (2004)\n",
      "Super High Me (2007)\n",
      "Secret Policeman's Other Ball, The (1982)\n",
      "Richard Pryor Live on the Sunset Strip (1982)\n",
      "Religulous (2008)\n",
      "Paper Heart (2009)\n",
      "Original Kings of Comedy, The (2000)\n",
      "Merci Patron ! (2016)\n",
      "Martin Lawrence Live: Runteldat (2002)\n",
      "Kevin Hart: Laugh at My Pain (2011)\n",
      "Jeff Ross Roasts Criminals: Live at Brazos County Jail (2015)\n",
      "Jackass: The Movie (2002)\n",
      "Jackass Number Two (2006)\n"
     ]
    }
   ],
   "source": [
    "movies = (\n",
    "    match()\n",
    "    .node(labels=\"Movie\", variable=\"m\")\n",
    "    .to(\"OF_GENRE\")\n",
    "    .node(labels=\"Genre\", variable=\"g1\")\n",
    "    .where(\"g1.name\", \"=\", \"Documentary\")\n",
    "    .match()\n",
    "    .node(labels=\"Movie\", variable=\"m\")\n",
    "    .to(\"OF_GENRE\")\n",
    "    .node(labels=\"Genre\", variable=\"g2\")\n",
    "    .where(\"g2.name\", \"=\", \"Comedy\")\n",
    "    .return_({\"m.title\": \"movie\"})\n",
    "    .order_by(\"m.title DESC\")\n",
    "    .limit(15)\n",
    "    .execute()\n",
    ")\n",
    "\n",
    "results = list(movies)\n",
    "\n",
    "for result in results:\n",
    "    print(result[\"movie\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Exercise 5\n",
    "\n",
    "**Find out the minimum rating of the 'Star Wars: Episode I - The Phantom Menace (1999)' movie.**\n",
    "\n",
    "\n",
    "The correct Cypher query is:\n",
    "\n",
    "```\n",
    "MATCH (:User)-[r:RATED]->(:Movie {title: 'Star Wars: Episode I - The Phantom Menace (1999)'})\n",
    "RETURN min(r.rating);\n",
    "```\n",
    "\n",
    "You can try it out in Memgraph Lab at `localhost:3000`.\n",
    "\n",
    "With GQLAlchemy's query builder, the solution is:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.5\n"
     ]
    }
   ],
   "source": [
    "rating = (\n",
    "    match()\n",
    "    .node(labels=\"User\")\n",
    "    .to(\"RATED\", variable=\"r\")\n",
    "    .node(labels=\"Movie\", variable=\"m\")\n",
    "    .where(\"m.title\", \"=\", \"Star Wars: Episode I - The Phantom Menace (1999)\")\n",
    "    .return_({\"min(r.rating)\": \"min_rating\"})\n",
    "    .execute()\n",
    ")\n",
    "\n",
    "results = list(rating)\n",
    "\n",
    "for result in results:\n",
    "    print(result[\"min_rating\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And that's it! If you have any issues with this notebook, feel free to open an issue on the [GitHub repository](https://github.com/pyladiesams/graphdbs-gqlalchemy-beginner-mar2022), or [join the Discord server](https://discord.gg/memgraph) and get your answer instantly. If you are interested in the Cypher query language and want to learn more, sign up for the free [Cypher Email Course](https://memgraph.com/learn-cypher-query-language)."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
