{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# GraphRAG in Memgraph\n",
    "\n",
    "In this tutorial, we will build GraphRAG using the Memgraph ecosystem and\n",
    "OpenAI. This example is based on a portion of a fixed Game of Thrones dataset,\n",
    "which will be enriched with unstructured data to create a knowledge graph. \n",
    "\n",
    "To search for relevant information, in this example we will use vector search on\n",
    "node embeddings to find schematically relevant data. Following this, the\n",
    "structured data will be extracted from the graph and passed to LLM to answer the\n",
    "question. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Prerequisites\n",
    "\n",
    "To begin with this tutorial, you will need Docker, Python and an OpenAI API key.\n",
    "With a few small tweaks, you can adapt this setup to run on your local Ollama\n",
    "environment. \n",
    "\n",
    "First, we need to start Memgraph with the vector search capabilities. You can do\n",
    "this by running the following command: \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "vscode": {
     "languageId": "shellscript"
    }
   },
   "source": [
    "```\n",
    "docker run -p 7687:7687 -p 7444:7444 memgraph/memgraph-mage:1.22-memgraph-2.22 \\\n",
    "  --log-level=TRACE \\\n",
    "  --also-log-to-stderr \\\n",
    "  --telemetry-enabled=False \\\n",
    "  --experimental-enabled=vector-search \\\n",
    "  --experimental-config='{\"vector-search\": {\"got_index\": {\"label\": \"Entity\", \"property\": \"embedding\", \"dimension\": 384, \"capacity\": 1000, \"metric\": \"cos\"}}}'\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "You can run this command outside of this notebook. \n",
    "\n",
    "Once Memgraph is running in the background, make sure to load the initial Game\n",
    "of Thrones dataset:  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "vscode": {
     "languageId": "shellscript"
    }
   },
   "source": [
    "\n",
    "```\n",
    "cat ./data/memgraph-export-got.cypherl | docker run -i memgraph/mgconsole --host=localhost\n",
    "echo \"MATCH (n), ()-[r]->() RETURN count(DISTINCT n) AS node_count, count(DISTINCT r) AS relationship_count;\" | docker run -i memgraph/mgconsole --host=host.docker.internal\n",
    "```\n",
    "```\n",
    "+--------------------+--------------------+\n",
    "| node_count         | relationship_count |\n",
    "+--------------------+--------------------+\n",
    "| 2677               | 11967              |\n",
    "+--------------------+--------------------+\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "After the dataset is ingested, install a few Python packages needed to run the demo:  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (5.27.0)\n",
      "Requirement already satisfied: pytz in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from neo4j) (2024.2)\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: sentence-transformers in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (3.3.1)\n",
      "Requirement already satisfied: transformers<5.0.0,>=4.41.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from sentence-transformers) (4.46.3)\n",
      "Requirement already satisfied: tqdm in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from sentence-transformers) (4.67.1)\n",
      "Requirement already satisfied: torch>=1.11.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from sentence-transformers) (2.5.1)\n",
      "Requirement already satisfied: scikit-learn in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from sentence-transformers) (1.5.2)\n",
      "Requirement already satisfied: scipy in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from sentence-transformers) (1.14.1)\n",
      "Requirement already satisfied: huggingface-hub>=0.20.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from sentence-transformers) (0.26.3)\n",
      "Requirement already satisfied: Pillow in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from sentence-transformers) (11.0.0)\n",
      "Requirement already satisfied: filelock in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from huggingface-hub>=0.20.0->sentence-transformers) (3.16.1)\n",
      "Requirement already satisfied: fsspec>=2023.5.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from huggingface-hub>=0.20.0->sentence-transformers) (2024.10.0)\n",
      "Requirement already satisfied: packaging>=20.9 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from huggingface-hub>=0.20.0->sentence-transformers) (24.2)\n",
      "Requirement already satisfied: pyyaml>=5.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from huggingface-hub>=0.20.0->sentence-transformers) (6.0.2)\n",
      "Requirement already satisfied: requests in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from huggingface-hub>=0.20.0->sentence-transformers) (2.32.3)\n",
      "Requirement already satisfied: typing-extensions>=3.7.4.3 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from huggingface-hub>=0.20.0->sentence-transformers) (4.12.2)\n",
      "Requirement already satisfied: networkx in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from torch>=1.11.0->sentence-transformers) (3.4.2)\n",
      "Requirement already satisfied: jinja2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from torch>=1.11.0->sentence-transformers) (3.1.4)\n",
      "Requirement already satisfied: setuptools in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from torch>=1.11.0->sentence-transformers) (75.6.0)\n",
      "Requirement already satisfied: sympy==1.13.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from torch>=1.11.0->sentence-transformers) (1.13.1)\n",
      "Requirement already satisfied: mpmath<1.4,>=1.1.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from sympy==1.13.1->torch>=1.11.0->sentence-transformers) (1.3.0)\n",
      "Requirement already satisfied: numpy>=1.17 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from transformers<5.0.0,>=4.41.0->sentence-transformers) (2.1.3)\n",
      "Requirement already satisfied: regex!=2019.12.17 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from transformers<5.0.0,>=4.41.0->sentence-transformers) (2024.11.6)\n",
      "Requirement already satisfied: tokenizers<0.21,>=0.20 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from transformers<5.0.0,>=4.41.0->sentence-transformers) (0.20.3)\n",
      "Requirement already satisfied: safetensors>=0.4.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from transformers<5.0.0,>=4.41.0->sentence-transformers) (0.4.5)\n",
      "Requirement already satisfied: joblib>=1.2.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from scikit-learn->sentence-transformers) (1.4.2)\n",
      "Requirement already satisfied: threadpoolctl>=3.1.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from scikit-learn->sentence-transformers) (3.5.0)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from jinja2->torch>=1.11.0->sentence-transformers) (3.0.2)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests->huggingface-hub>=0.20.0->sentence-transformers) (3.4.0)\n",
      "Requirement already satisfied: idna<4,>=2.5 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests->huggingface-hub>=0.20.0->sentence-transformers) (3.10)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests->huggingface-hub>=0.20.0->sentence-transformers) (2.2.3)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests->huggingface-hub>=0.20.0->sentence-transformers) (2024.8.30)\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: openai in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (1.56.1)\n",
      "Requirement already satisfied: anyio<5,>=3.5.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from openai) (4.6.2.post1)\n",
      "Requirement already satisfied: distro<2,>=1.7.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from openai) (1.9.0)\n",
      "Requirement already satisfied: httpx<1,>=0.23.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from openai) (0.28.0)\n",
      "Requirement already satisfied: jiter<1,>=0.4.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from openai) (0.8.0)\n",
      "Requirement already satisfied: pydantic<3,>=1.9.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from openai) (2.10.3)\n",
      "Requirement already satisfied: sniffio in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from openai) (1.3.1)\n",
      "Requirement already satisfied: tqdm>4 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from openai) (4.67.1)\n",
      "Requirement already satisfied: typing-extensions<5,>=4.11 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from openai) (4.12.2)\n",
      "Requirement already satisfied: idna>=2.8 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from anyio<5,>=3.5.0->openai) (3.10)\n",
      "Requirement already satisfied: certifi in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from httpx<1,>=0.23.0->openai) (2024.8.30)\n",
      "Requirement already satisfied: httpcore==1.* in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from httpx<1,>=0.23.0->openai) (1.0.7)\n",
      "Requirement already satisfied: h11<0.15,>=0.13 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from httpcore==1.*->httpx<1,>=0.23.0->openai) (0.14.0)\n",
      "Requirement already satisfied: annotated-types>=0.6.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from pydantic<3,>=1.9.0->openai) (0.7.0)\n",
      "Requirement already satisfied: pydantic-core==2.27.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from pydantic<3,>=1.9.0->openai) (2.27.1)\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: python-dotenv in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (1.0.1)\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "\n",
    "%pip install neo4j                   # for driver and connection to Memgraph\n",
    "%pip install sentence-transformers   # for calculating sentence embeddings\n",
    "%pip install openai                  # for access to LLM\n",
    "%pip install python-dotenv           # for environment variables\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Enrich knowledge graph with the embeddings \n",
    "\n",
    "In GraphRAG, you are not writing actual Cypher queries, but you are\n",
    "asking the questions about your domain knowledge graph in plain English. From your question, you want to\n",
    "retrieve relevant parts of the knowledge graph. \n",
    "\n",
    "To achieve this, you can encode the semantic meaning into the graph so you can locate\n",
    "the semantically similar parts of the graph based on the question you have provided.\n",
    "\n",
    "There are a several approaches to consider: embedding the node labels and\n",
    "properties, embedding the triplets related to a node or embedding specific paths\n",
    "a node can take. Adding more data into embeddings requires a vector with more\n",
    "dimensions, which can be costly in terms of memory and performance. \n",
    "\n",
    "However, embedding triplets or paths, will yield better results, and you can\n",
    "locate semantically similar parts of the graph with greater accuracy. This means\n",
    "that for longer questions, semantic search is more likely to find the right part\n",
    "of the graph. \n",
    "\n",
    "If the semantic search misses relevant parts of the graph, the LLM will not be\n",
    "able to answer the question correctly. \n",
    "\n",
    "To illustrate a basic example, here is a function that calculates embeddings\n",
    "based on the node labels an properties: \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "def compute_embeddings(driver, model):\n",
    "    with driver.session() as session:\n",
    "\n",
    "        # Retrieve all nodes\n",
    "        result = session.run(\"MATCH (n) RETURN n\")\n",
    "\n",
    "        for record in result:\n",
    "            node = record[\"n\"]\n",
    "            # Combine node labels and properties into a single string\n",
    "            node_data = (\n",
    "                \" \".join(node.labels)\n",
    "                + \" \"\n",
    "                + \" \".join(f\"{k}: {v}\" for k, v in node.items())\n",
    "            )\n",
    "\n",
    "            # Compute the embedding for the node\n",
    "            node_embedding = model.encode(node_data)\n",
    "\n",
    "            # Store the embedding back into the node\n",
    "            session.run(\n",
    "                f\"MATCH (n) WHERE id(n) = {node.element_id} SET n.embedding = {node_embedding.tolist()}\"\n",
    "            )\n",
    "\n",
    "        # Set the label to Entity for all nodes\n",
    "        session.run(\"MATCH (n) SET n:Entity\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If we have a node `:Character {name:\"Viserys Targaryen\"}` in the graph, the\n",
    "encoded embedding will include the label `:Charater` and the property\n",
    "`name:Viserys Targaryen`.\n",
    "\n",
    "Asking the question `Who is Viserys Targaryen?` will yield a very similar\n",
    "embedding, allowing you to locate that node in the graph. However, if you ask a\n",
    "longer question like, `To whom was Viserys Targaryen Loyal in season 1 of Game\n",
    "of Thrones?`, there is a chance that this question might not locate the `Viserys\n",
    "Targaryen` node in the graph due to its length and complexity. \n",
    "\n",
    "Embedding a triplet on the node will yield a better result in this case. \n",
    "\n",
    "In the end, each node will get a `Entity` label so you can perform the vector search on top of all the nodes in the database. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Finding the relevant part of the graph\n",
    "\n",
    "Once embeddings are calculated in your graph, you can perform a search based on\n",
    "these embeddings by using a vector search. \n",
    "\n",
    "Memgraph supports vector search starting from version 2.22.  \n",
    "\n",
    "The goal is to find the most similar node that resembles your question and to\n",
    "extract the relevant knowledge from it. The function takes the question's\n",
    "embedding and compares it to the embeddings stored on the nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_most_similar_node(driver, question_embedding):\n",
    "\n",
    "    with driver.session() as session:\n",
    "        # Perform the vector search on all nodes based on the question embedding\n",
    "        result = session.run(\n",
    "            f\"CALL vector_search.search('got_index', 10, {question_embedding.tolist()}) YIELD * RETURN *;\"\n",
    "        )\n",
    "        nodes_data = []\n",
    "        \n",
    "        # Retrieve all similar nodes and print them\n",
    "        for record in result:\n",
    "            node = record[\"node\"]\n",
    "            properties = {k: v for k, v in node.items() if k != \"embedding\"}\n",
    "            node_data = {\n",
    "                \"distance\": record[\"distance\"],\n",
    "                \"id\": node.element_id,\n",
    "                \"labels\": list(node.labels),\n",
    "                \"properties\": properties,\n",
    "            }\n",
    "            nodes_data.append(node_data)\n",
    "        print(\"All similar nodes:\")\n",
    "        for node in nodes_data:\n",
    "            print(node)\n",
    "\n",
    "        # Return the most similar node\n",
    "        return nodes_data[0] if nodes_data else None"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Based on the similarity between the question embeddings and node embeddings, we\n",
    "get the most similar node. This node serves as a pivot point from which we can\n",
    "pull relevant data. For example, if we are searching for information about\n",
    "`Viserys Targaryen`, we would pull data surrounding that node, making it our\n",
    "pivot node. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Getting the relevant data\n",
    "\n",
    "Once we have the pivot node, we can begin retrieving the relevant structured\n",
    "data around it. The most straightforward approach is to perform multiple hops\n",
    "from the pivot node. \n",
    "\n",
    "Here is the function that fetches the data around pivot node, a specified number\n",
    "of `hops` away from the pivot node.  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_relevant_data(driver, node, hops):\n",
    "    with driver.session() as session:\n",
    "        # Retrieve the paths from the node to other nodes that are 'hops' away\n",
    "        query = (\n",
    "            f\"MATCH path=((n)-[r*..{hops}]-(m)) WHERE id(n) = {node['id']} RETURN path\"\n",
    "        )\n",
    "        result = session.run(query)\n",
    "\n",
    "        paths = []\n",
    "        for record in result:\n",
    "            path_data = []\n",
    "            for segment in record[\"path\"]:\n",
    "\n",
    "                # Process start node without 'embedding' property\n",
    "                start_node_data = {\n",
    "                    k: v for k, v in segment.start_node.items() if k != \"embedding\"\n",
    "                }\n",
    "\n",
    "                # Process relationship data\n",
    "                relationship_data = {\n",
    "                    \"type\": segment.type,\n",
    "                    \"properties\": segment.get(\"properties\", {}),\n",
    "                }\n",
    "\n",
    "                # Process end node without 'embedding' property\n",
    "                end_node_data = {\n",
    "                    k: v for k, v in segment.end_node.items() if k != \"embedding\"\n",
    "                }\n",
    "\n",
    "                # Add to path_data as a tuple (start_node, relationship, end_node)\n",
    "                path_data.append((start_node_data, relationship_data, end_node_data))\n",
    "\n",
    "            paths.append(path_data)\n",
    "\n",
    "        # Return all paths\n",
    "        return paths"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "TODO: Insert a picture showing this. \n",
    "\n",
    "To avoid overloading the LLM's limited context with non-relevant data, we drop\n",
    "the embedding property from the nodes. Embeddings contain a lot of data that\n",
    "isn't particularly relevant to the LLM. \n",
    "\n",
    "## Helper functions \n",
    "\n",
    "For the LLM to understand its task, we need specific prompts. The `RAG_prompt`\n",
    "describes how the LLM should answer the question, while the `question_prompt` is\n",
    "optimized for calculating question embeddings by extracting only the key pices\n",
    "of information to improve embedding accuracy. For example, if you ask, `Who is\n",
    "Viserys Targaryen?`, only the `Viserys Targaryen` will be extracted from the\n",
    "question. Ultimately, the LLM will receive the full question back in the\n",
    "`RAG_prompt`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "def RAG_prompt(question, relevance_expansion_data):\n",
    "    prompt = f\"\"\"\n",
    "    You are an AI language model. I will provide you with a question and a set of data obtained through a relevance expansion process in a graph database. The relevance expansion process finds nodes connected to a target node within a specified number of hops and includes the relationships between these nodes.\n",
    "\n",
    "    Question: {question}\n",
    "\n",
    "    Relevance Expansion Data:\n",
    "    {relevance_expansion_data}\n",
    "\n",
    "    Based on the provided data, please answer the question, make sure to base your answers only based on the provided data. Add a context on what data did you base your answer on.\n",
    "    \"\"\"\n",
    "    return prompt\n",
    "\n",
    "\n",
    "def question_prompt(question):\n",
    "    prompt = f\"\"\"\n",
    "    You are an AI language model. I will provide you with a question. \n",
    "    Extract the key information from the questions. The key information is important information that is required to answer the question.\n",
    "\n",
    "    Question: {question}\n",
    "\n",
    "    The output format should be like this: \n",
    "    Key Information: [key information 1], [key information 2], ...\n",
    "    \"\"\"\n",
    "    return prompt\n",
    "\n",
    "\n",
    "async def get_response(client, prompt):\n",
    "    response = await client.chat.completions.create(\n",
    "        model=\"gpt-3.5-turbo\", messages=[{\"role\": \"user\", \"content\": prompt}]\n",
    "    )\n",
    "    return response.choices[0].message.content\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Running the graphRAG\n",
    "\n",
    "Now, it all comes together in the `main` function: \n",
    "\n",
    "1. Connect to the database \n",
    "2. Load the .env file with the `OPENAI_API_KEY=` defined\n",
    "3. Compute and store the node embeddings \n",
    "4. Compute the question embedding based on key information \n",
    "5. Perform the vector search to find the most semantically similar node\n",
    "6. Get the relevant data that is a few hops away from the pivot node\n",
    "7. Ask LLM the question with the relevant data "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "## Get all dependencies \n",
    "from sentence_transformers import SentenceTransformer\n",
    "from dotenv import load_dotenv\n",
    "import neo4j\n",
    "import asyncio\n",
    "from openai import AsyncOpenAI\n",
    "import os\n",
    "import json\n",
    "from collections import Counter\n",
    "from pathlib import Path\n",
    "import nest_asyncio\n",
    "\n",
    "# Create a driver\n",
    "driver = neo4j.GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"\", \"\"))\n",
    "# Load the SentenceTransformer model\n",
    "model = SentenceTransformer(\"paraphrase-MiniLM-L6-v2\")\n",
    "compute_embeddings(driver, model)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Key Information: Viserys Targaryen, killed, episode\n",
      "All similar nodes:\n",
      "{'distance': 0.7424314022064209, 'id': '387', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}}\n",
      "{'distance': 0.7443174123764038, 'id': '412', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 9.5, 'name': 'The Dance of Dragons', 'number': 9}}\n",
      "{'distance': 0.7458397150039673, 'id': '382', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 8.6, 'name': 'Dark Wings Dark Words', 'number': 2}}\n",
      "{'distance': 0.7462430000305176, 'id': '398', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 8.5, 'name': 'High Sparrow', 'number': 3}}\n",
      "{'distance': 0.7473532557487488, 'id': '430', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 9.9, 'name': 'The Winds of Winter', 'number': 10}}\n",
      "{'distance': 0.7474308013916016, 'id': '442', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 8.4, 'name': 'No One', 'number': 8}}\n",
      "{'distance': 0.7484148740768433, 'id': '422', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 8.5, 'name': 'The House of Black and White', 'number': 2}}\n",
      "{'distance': 0.7490541338920593, 'id': '403', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 8.6, 'name': 'Dragonstone', 'number': 1}}\n",
      "{'distance': 0.7502472996711731, 'id': '438', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 9.2, 'name': 'You Win or You Die', 'number': 7}}\n",
      "{'distance': 0.7507607936859131, 'id': '388', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 8, 'name': 'Unbowed Unbent Unbroken', 'number': 6}}\n",
      "The most similar node is:\n",
      "{'distance': 0.7424314022064209, 'id': '387', 'labels': ['Episode', 'Entity'], 'properties': {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}}\n",
      "The relevant data is:\n",
      "[[({'order': 630}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 630}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Ramsay Bolton'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 630})], [({'order': 630}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Osha'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 630})], [({'order': 630}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 630}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 630}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 630}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Winterfell'})], [({'order': 633}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 633}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 633})], [({'order': 633}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 633})], [({'order': 633}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 633}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 633}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 633}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 635}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 635}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 635})], [({'order': 635}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 635})], [({'order': 635}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 635}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 635}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 635}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 638}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 638}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 638})], [({'order': 638}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 638})], [({'order': 638}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 638}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 638}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 638}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 642}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 642}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 642})], [({'order': 642}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 642})], [({'order': 642}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 642}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 642}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 642}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 641}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 641}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 641})], [({'order': 641}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 641})], [({'order': 641}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 641}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 641}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 641}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 643}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 643}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 643})], [({'order': 643}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 643})], [({'order': 643}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 643}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 643}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 643}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 639}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 639}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 639})], [({'order': 639}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 639})], [({'order': 639}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 639}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 639}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 639}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 645}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 645}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 645})], [({'order': 645}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 645})], [({'order': 645}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 645}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 645}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 645}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 631}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 631}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 631})], [({'order': 631}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Khal Moro'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 631})], [({'order': 631}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 631}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 631}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 631}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 632}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 632}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 632})], [({'order': 632}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 632})], [({'order': 632}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 632}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 632}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 632}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 634}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 634}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 634})], [({'order': 634}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 634})], [({'order': 634}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 634}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 634}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 634}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 636}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 636}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 636})], [({'order': 636}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 636})], [({'order': 636}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 636}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 636}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 636}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 644}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 644}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 644})], [({'order': 644}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 644})], [({'order': 644}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 644}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 644}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 644}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 637}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 637}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 637})], [({'order': 637}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 637})], [({'order': 637}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 637}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 637}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 637}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 640}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 640}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki Khal'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 640})], [({'order': 640}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daenerys Targaryen'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 640})], [({'order': 640}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 640}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 640}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 640}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 628}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 628}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daario Naharis'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 628})], [({'order': 628}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki man'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 628})], [({'order': 628}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 628}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 628}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 628}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'order': 629}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4})], [({'order': 629}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Daario Naharis'}, {'type': 'KILLER_IN', 'properties': {}}, {'order': 629})], [({'order': 629}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'name': 'Dothraki man'}, {'type': 'VICTIM_IN', 'properties': {}}, {'order': 629})], [({'order': 629}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 629}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'order': 629}, {'type': 'HAPPENED_IN', 'properties': {}}, {'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}), ({'order': 629}, {'type': 'HAPPENED_IN', 'properties': {}}, {'name': 'Vaes Dothrak'})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'imdb_rating': 8.7, 'name': 'Oathbreaker', 'number': 3}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'imdb_rating': 9.7, 'name': 'The Door', 'number': 5}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'imdb_rating': 8.5, 'name': 'The Red Woman', 'number': 1}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'imdb_rating': 9.4, 'name': 'Home', 'number': 2}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'imdb_rating': 8.6, 'name': 'The Broken Man', 'number': 7}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'imdb_rating': 9.9, 'name': 'The Winds of Winter', 'number': 10}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'imdb_rating': 9.9, 'name': 'Battle of the Bastards', 'number': 9}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'imdb_rating': 8.4, 'name': 'No One', 'number': 8}, {'type': 'PART_OF', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 809}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 813}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 819}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 821}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 825}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 828}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 834}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 847}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 973}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 781}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 734}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 865}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 746}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 845}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 760}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 894}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 840}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 889}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 842}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 989}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 812}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 829}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 915}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 892}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 855}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 975}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 848}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 902}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 940}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 884}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 900}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 933}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 906}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 946}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 912}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 931}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 942}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 987}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 979}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 603}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 612}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 615}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 617}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 622}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 630}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 633}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 635}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 638}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 642}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 646}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 653}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 655}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 657}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 685}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 689}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 693}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 695}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 701}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 703}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 707}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 711}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 713}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 716}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 722}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 728}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 742}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 748}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 749}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 751}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 755}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 756}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 757}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 759}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 761}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 763}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 765}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 775}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 777}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 787}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 810}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 814}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 816}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 818}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 820}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 822}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 824}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 827}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 833}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 836}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 838}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 844}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 846}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 850}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 851}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 853}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 854}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 857}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 861}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 863}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 867}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 887}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 888}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 890}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 896}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 898}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 904}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 909}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 917}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 919}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 923}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 925}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 927}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 929}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 935}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 938}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 982}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 984}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 991}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 758}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 817}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 823}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 801}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 641}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 643}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 950}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 901}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 609}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 607}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 614}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 770}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 830}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 899}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 886}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 849}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 661}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 671}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 667}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 856}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 627}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 790}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 826}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 767}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 791}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 673}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 860}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 811}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 803}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 772}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 805}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 807}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 948}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 806}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 832}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 852}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 879}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 974}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 815}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 877}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 961}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 871}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 881}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 873}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 862}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 910}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 903}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 955}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 885}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 969}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 897}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 972}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 983}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 913}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 971}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 978}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 967}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 993}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 980}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 997}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 866}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 868}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 869}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 882}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 883}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 891}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 893}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 895}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 905}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 907}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 908}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 911}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 952}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 957}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 959}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 963}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 965}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 976}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 981}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 605}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 611}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 613}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 616}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 619}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 621}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 623}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 625}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 639}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 645}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 647}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 649}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 663}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 665}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 669}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 676}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 691}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 762}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 764}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 766}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 768}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 793}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 795}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 797}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 799}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 858}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 864}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 986}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 998}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 626}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 631}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 632}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 634}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 636}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 654}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 656}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 660}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 666}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 677}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 678}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 684}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 694}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 696}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 700}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 706}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 708}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 710}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 717}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 721}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 723}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 727}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 729}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 731}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 733}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 740}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 741}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 745}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 747}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 750}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 752}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 769}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 771}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 774}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 780}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 782}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 786}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 789}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 796}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 798}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 800}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 802}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 804}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 841}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 874}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 876}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 878}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 916}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 920}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 924}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 926}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 928}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 937}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 939}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 943}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 947}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 953}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 960}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 964}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 968}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 970}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 988}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 990}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 995}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 921}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 652}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 753}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 779}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 831}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 944}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 977}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 985}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 705}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 718}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 610}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 606}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 644}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 637}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 697}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 658}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 608}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 648}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 686}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 699}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 618}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 730}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 726}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 604}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 690}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 683}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 720}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 620}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 650}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 640}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 692}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 651}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 744}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 679}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 783}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 732}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 835}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 709}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 687}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 914}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 736}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 785}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 859}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 843}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 837}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 724}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 808}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 739}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 674}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 681}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 702}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 712}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 725}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 956}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 958}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 792}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 784}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 688}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 662}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 778}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 994}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 675}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 668}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 936}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 628}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 704}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 624}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 735}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 922}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 698}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 872}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 629}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 659}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 670}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 664}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 715}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 672}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 714}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 682}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 719}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 680}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 930}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 839}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 773}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 738}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 737}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 954}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 945}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 880}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 788}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 743}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 754}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 875}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 776}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 870}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 794}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 996}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 992}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 918}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 934}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 951}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 932}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 949}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 941}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 962}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})], [({'imdb_rating': 9.1, 'name': 'Book of the Stranger', 'number': 4}, {'type': 'PART_OF', 'properties': {}}, {'number': 6}), ({'order': 966}, {'type': 'HAPPENED_IN', 'properties': {}}, {'number': 6})]]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Exception ignored in: <coroutine object get_response at 0x308b706d0>\n",
      "Traceback (most recent call last):\n",
      "  File \"<string>\", line 1, in <lambda>\n",
      "KeyError: '__import__'\n",
      "Exception ignored in: <coroutine object get_response at 0x308b706d0>\n",
      "Traceback (most recent call last):\n",
      "  File \"<string>\", line 1, in <lambda>\n",
      "KeyError: '__import__'\n"
     ]
    },
    {
     "ename": "BadRequestError",
     "evalue": "Error code: 400 - {'error': {'message': \"This model's maximum context length is 16385 tokens. However, your messages resulted in 36302 tokens. Please reduce the length of the messages.\", 'type': 'invalid_request_error', 'param': 'messages', 'code': 'context_length_exceeded'}}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mBadRequestError\u001b[0m                           Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[33], line 41\u001b[0m\n\u001b[1;32m     38\u001b[0m     \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mThe response is:\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m     39\u001b[0m     \u001b[38;5;28mprint\u001b[39m(response)\n\u001b[0;32m---> 41\u001b[0m \u001b[43mask_question\u001b[49m\u001b[43m(\u001b[49m\u001b[43mdriver\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mquestion\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mmodel\u001b[49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[33], line 37\u001b[0m, in \u001b[0;36mask_question\u001b[0;34m(driver, question, model)\u001b[0m\n\u001b[1;32m     35\u001b[0m \u001b[38;5;66;03m# LLM answers the question based on the relevant data\u001b[39;00m\n\u001b[1;32m     36\u001b[0m prompt \u001b[38;5;241m=\u001b[39m RAG_prompt(question, relevant_data)\n\u001b[0;32m---> 37\u001b[0m response \u001b[38;5;241m=\u001b[39m \u001b[43masyncio\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mget_response\u001b[49m\u001b[43m(\u001b[49m\u001b[43mclient\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m)\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m     38\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mThe response is:\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m     39\u001b[0m \u001b[38;5;28mprint\u001b[39m(response)\n",
      "File \u001b[0;32m~/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages/nest_asyncio.py:30\u001b[0m, in \u001b[0;36m_patch_asyncio.<locals>.run\u001b[0;34m(main, debug)\u001b[0m\n\u001b[1;32m     28\u001b[0m task \u001b[38;5;241m=\u001b[39m asyncio\u001b[38;5;241m.\u001b[39mensure_future(main)\n\u001b[1;32m     29\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m---> 30\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mloop\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun_until_complete\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtask\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m     31\u001b[0m \u001b[38;5;28;01mfinally\u001b[39;00m:\n\u001b[1;32m     32\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m task\u001b[38;5;241m.\u001b[39mdone():\n",
      "File \u001b[0;32m~/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages/nest_asyncio.py:98\u001b[0m, in \u001b[0;36m_patch_loop.<locals>.run_until_complete\u001b[0;34m(self, future)\u001b[0m\n\u001b[1;32m     95\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m f\u001b[38;5;241m.\u001b[39mdone():\n\u001b[1;32m     96\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mRuntimeError\u001b[39;00m(\n\u001b[1;32m     97\u001b[0m         \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mEvent loop stopped before Future completed.\u001b[39m\u001b[38;5;124m'\u001b[39m)\n\u001b[0;32m---> 98\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mf\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mresult\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/homebrew/Cellar/python@3.12/3.12.7/Frameworks/Python.framework/Versions/3.12/lib/python3.12/asyncio/futures.py:203\u001b[0m, in \u001b[0;36mFuture.result\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    201\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__log_traceback \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mFalse\u001b[39;00m\n\u001b[1;32m    202\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exception \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[0;32m--> 203\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exception\u001b[38;5;241m.\u001b[39mwith_traceback(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exception_tb)\n\u001b[1;32m    204\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_result\n",
      "File \u001b[0;32m/opt/homebrew/Cellar/python@3.12/3.12.7/Frameworks/Python.framework/Versions/3.12/lib/python3.12/asyncio/tasks.py:314\u001b[0m, in \u001b[0;36mTask.__step_run_and_handle_result\u001b[0;34m(***failed resolving arguments***)\u001b[0m\n\u001b[1;32m    310\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m    311\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m exc \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[1;32m    312\u001b[0m         \u001b[38;5;66;03m# We use the `send` method directly, because coroutines\u001b[39;00m\n\u001b[1;32m    313\u001b[0m         \u001b[38;5;66;03m# don't have `__iter__` and `__next__` methods.\u001b[39;00m\n\u001b[0;32m--> 314\u001b[0m         result \u001b[38;5;241m=\u001b[39m \u001b[43mcoro\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43msend\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m)\u001b[49m\n\u001b[1;32m    315\u001b[0m     \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m    316\u001b[0m         result \u001b[38;5;241m=\u001b[39m coro\u001b[38;5;241m.\u001b[39mthrow(exc)\n",
      "Cell \u001b[0;32mIn[30], line 29\u001b[0m, in \u001b[0;36mget_response\u001b[0;34m(client, prompt)\u001b[0m\n\u001b[1;32m     28\u001b[0m \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mget_response\u001b[39m(client, prompt):\n\u001b[0;32m---> 29\u001b[0m     response \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mawait\u001b[39;00m client\u001b[38;5;241m.\u001b[39mchat\u001b[38;5;241m.\u001b[39mcompletions\u001b[38;5;241m.\u001b[39mcreate(\n\u001b[1;32m     30\u001b[0m         model\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mgpt-3.5-turbo\u001b[39m\u001b[38;5;124m\"\u001b[39m, messages\u001b[38;5;241m=\u001b[39m[{\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mrole\u001b[39m\u001b[38;5;124m\"\u001b[39m: \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124muser\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mcontent\u001b[39m\u001b[38;5;124m\"\u001b[39m: prompt}]\n\u001b[1;32m     31\u001b[0m     )\n\u001b[1;32m     32\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m response\u001b[38;5;241m.\u001b[39mchoices[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mmessage\u001b[38;5;241m.\u001b[39mcontent\n",
      "File \u001b[0;32m~/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages/openai/resources/chat/completions.py:1661\u001b[0m, in \u001b[0;36mAsyncCompletions.create\u001b[0;34m(self, messages, model, audio, frequency_penalty, function_call, functions, logit_bias, logprobs, max_completion_tokens, max_tokens, metadata, modalities, n, parallel_tool_calls, prediction, presence_penalty, response_format, seed, service_tier, stop, store, stream, stream_options, temperature, tool_choice, tools, top_logprobs, top_p, user, extra_headers, extra_query, extra_body, timeout)\u001b[0m\n\u001b[1;32m   1620\u001b[0m \u001b[38;5;129m@required_args\u001b[39m([\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmessages\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmodel\u001b[39m\u001b[38;5;124m\"\u001b[39m], [\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmessages\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmodel\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mstream\u001b[39m\u001b[38;5;124m\"\u001b[39m])\n\u001b[1;32m   1621\u001b[0m \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mcreate\u001b[39m(\n\u001b[1;32m   1622\u001b[0m     \u001b[38;5;28mself\u001b[39m,\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m   1658\u001b[0m     timeout: \u001b[38;5;28mfloat\u001b[39m \u001b[38;5;241m|\u001b[39m httpx\u001b[38;5;241m.\u001b[39mTimeout \u001b[38;5;241m|\u001b[39m \u001b[38;5;28;01mNone\u001b[39;00m \u001b[38;5;241m|\u001b[39m NotGiven \u001b[38;5;241m=\u001b[39m NOT_GIVEN,\n\u001b[1;32m   1659\u001b[0m ) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m ChatCompletion \u001b[38;5;241m|\u001b[39m AsyncStream[ChatCompletionChunk]:\n\u001b[1;32m   1660\u001b[0m     validate_response_format(response_format)\n\u001b[0;32m-> 1661\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mawait\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_post(\n\u001b[1;32m   1662\u001b[0m         \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m/chat/completions\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m   1663\u001b[0m         body\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mawait\u001b[39;00m async_maybe_transform(\n\u001b[1;32m   1664\u001b[0m             {\n\u001b[1;32m   1665\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmessages\u001b[39m\u001b[38;5;124m\"\u001b[39m: messages,\n\u001b[1;32m   1666\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmodel\u001b[39m\u001b[38;5;124m\"\u001b[39m: model,\n\u001b[1;32m   1667\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124maudio\u001b[39m\u001b[38;5;124m\"\u001b[39m: audio,\n\u001b[1;32m   1668\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mfrequency_penalty\u001b[39m\u001b[38;5;124m\"\u001b[39m: frequency_penalty,\n\u001b[1;32m   1669\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mfunction_call\u001b[39m\u001b[38;5;124m\"\u001b[39m: function_call,\n\u001b[1;32m   1670\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mfunctions\u001b[39m\u001b[38;5;124m\"\u001b[39m: functions,\n\u001b[1;32m   1671\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mlogit_bias\u001b[39m\u001b[38;5;124m\"\u001b[39m: logit_bias,\n\u001b[1;32m   1672\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mlogprobs\u001b[39m\u001b[38;5;124m\"\u001b[39m: logprobs,\n\u001b[1;32m   1673\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmax_completion_tokens\u001b[39m\u001b[38;5;124m\"\u001b[39m: max_completion_tokens,\n\u001b[1;32m   1674\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmax_tokens\u001b[39m\u001b[38;5;124m\"\u001b[39m: max_tokens,\n\u001b[1;32m   1675\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmetadata\u001b[39m\u001b[38;5;124m\"\u001b[39m: metadata,\n\u001b[1;32m   1676\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmodalities\u001b[39m\u001b[38;5;124m\"\u001b[39m: modalities,\n\u001b[1;32m   1677\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mn\u001b[39m\u001b[38;5;124m\"\u001b[39m: n,\n\u001b[1;32m   1678\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mparallel_tool_calls\u001b[39m\u001b[38;5;124m\"\u001b[39m: parallel_tool_calls,\n\u001b[1;32m   1679\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mprediction\u001b[39m\u001b[38;5;124m\"\u001b[39m: prediction,\n\u001b[1;32m   1680\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mpresence_penalty\u001b[39m\u001b[38;5;124m\"\u001b[39m: presence_penalty,\n\u001b[1;32m   1681\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mresponse_format\u001b[39m\u001b[38;5;124m\"\u001b[39m: response_format,\n\u001b[1;32m   1682\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mseed\u001b[39m\u001b[38;5;124m\"\u001b[39m: seed,\n\u001b[1;32m   1683\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mservice_tier\u001b[39m\u001b[38;5;124m\"\u001b[39m: service_tier,\n\u001b[1;32m   1684\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mstop\u001b[39m\u001b[38;5;124m\"\u001b[39m: stop,\n\u001b[1;32m   1685\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mstore\u001b[39m\u001b[38;5;124m\"\u001b[39m: store,\n\u001b[1;32m   1686\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mstream\u001b[39m\u001b[38;5;124m\"\u001b[39m: stream,\n\u001b[1;32m   1687\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mstream_options\u001b[39m\u001b[38;5;124m\"\u001b[39m: stream_options,\n\u001b[1;32m   1688\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtemperature\u001b[39m\u001b[38;5;124m\"\u001b[39m: temperature,\n\u001b[1;32m   1689\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtool_choice\u001b[39m\u001b[38;5;124m\"\u001b[39m: tool_choice,\n\u001b[1;32m   1690\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtools\u001b[39m\u001b[38;5;124m\"\u001b[39m: tools,\n\u001b[1;32m   1691\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtop_logprobs\u001b[39m\u001b[38;5;124m\"\u001b[39m: top_logprobs,\n\u001b[1;32m   1692\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtop_p\u001b[39m\u001b[38;5;124m\"\u001b[39m: top_p,\n\u001b[1;32m   1693\u001b[0m                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124muser\u001b[39m\u001b[38;5;124m\"\u001b[39m: user,\n\u001b[1;32m   1694\u001b[0m             },\n\u001b[1;32m   1695\u001b[0m             completion_create_params\u001b[38;5;241m.\u001b[39mCompletionCreateParams,\n\u001b[1;32m   1696\u001b[0m         ),\n\u001b[1;32m   1697\u001b[0m         options\u001b[38;5;241m=\u001b[39mmake_request_options(\n\u001b[1;32m   1698\u001b[0m             extra_headers\u001b[38;5;241m=\u001b[39mextra_headers, extra_query\u001b[38;5;241m=\u001b[39mextra_query, extra_body\u001b[38;5;241m=\u001b[39mextra_body, timeout\u001b[38;5;241m=\u001b[39mtimeout\n\u001b[1;32m   1699\u001b[0m         ),\n\u001b[1;32m   1700\u001b[0m         cast_to\u001b[38;5;241m=\u001b[39mChatCompletion,\n\u001b[1;32m   1701\u001b[0m         stream\u001b[38;5;241m=\u001b[39mstream \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m,\n\u001b[1;32m   1702\u001b[0m         stream_cls\u001b[38;5;241m=\u001b[39mAsyncStream[ChatCompletionChunk],\n\u001b[1;32m   1703\u001b[0m     )\n",
      "File \u001b[0;32m~/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages/openai/_base_client.py:1843\u001b[0m, in \u001b[0;36mAsyncAPIClient.post\u001b[0;34m(self, path, cast_to, body, files, options, stream, stream_cls)\u001b[0m\n\u001b[1;32m   1829\u001b[0m \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mpost\u001b[39m(\n\u001b[1;32m   1830\u001b[0m     \u001b[38;5;28mself\u001b[39m,\n\u001b[1;32m   1831\u001b[0m     path: \u001b[38;5;28mstr\u001b[39m,\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m   1838\u001b[0m     stream_cls: \u001b[38;5;28mtype\u001b[39m[_AsyncStreamT] \u001b[38;5;241m|\u001b[39m \u001b[38;5;28;01mNone\u001b[39;00m \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mNone\u001b[39;00m,\n\u001b[1;32m   1839\u001b[0m ) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m ResponseT \u001b[38;5;241m|\u001b[39m _AsyncStreamT:\n\u001b[1;32m   1840\u001b[0m     opts \u001b[38;5;241m=\u001b[39m FinalRequestOptions\u001b[38;5;241m.\u001b[39mconstruct(\n\u001b[1;32m   1841\u001b[0m         method\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mpost\u001b[39m\u001b[38;5;124m\"\u001b[39m, url\u001b[38;5;241m=\u001b[39mpath, json_data\u001b[38;5;241m=\u001b[39mbody, files\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mawait\u001b[39;00m async_to_httpx_files(files), \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39moptions\n\u001b[1;32m   1842\u001b[0m     )\n\u001b[0;32m-> 1843\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mawait\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mrequest(cast_to, opts, stream\u001b[38;5;241m=\u001b[39mstream, stream_cls\u001b[38;5;241m=\u001b[39mstream_cls)\n",
      "File \u001b[0;32m~/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages/openai/_base_client.py:1537\u001b[0m, in \u001b[0;36mAsyncAPIClient.request\u001b[0;34m(self, cast_to, options, stream, stream_cls, remaining_retries)\u001b[0m\n\u001b[1;32m   1534\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m   1535\u001b[0m     retries_taken \u001b[38;5;241m=\u001b[39m \u001b[38;5;241m0\u001b[39m\n\u001b[0;32m-> 1537\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mawait\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_request(\n\u001b[1;32m   1538\u001b[0m     cast_to\u001b[38;5;241m=\u001b[39mcast_to,\n\u001b[1;32m   1539\u001b[0m     options\u001b[38;5;241m=\u001b[39moptions,\n\u001b[1;32m   1540\u001b[0m     stream\u001b[38;5;241m=\u001b[39mstream,\n\u001b[1;32m   1541\u001b[0m     stream_cls\u001b[38;5;241m=\u001b[39mstream_cls,\n\u001b[1;32m   1542\u001b[0m     retries_taken\u001b[38;5;241m=\u001b[39mretries_taken,\n\u001b[1;32m   1543\u001b[0m )\n",
      "File \u001b[0;32m~/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages/openai/_base_client.py:1638\u001b[0m, in \u001b[0;36mAsyncAPIClient._request\u001b[0;34m(self, cast_to, options, stream, stream_cls, retries_taken)\u001b[0m\n\u001b[1;32m   1635\u001b[0m         \u001b[38;5;28;01mawait\u001b[39;00m err\u001b[38;5;241m.\u001b[39mresponse\u001b[38;5;241m.\u001b[39maread()\n\u001b[1;32m   1637\u001b[0m     log\u001b[38;5;241m.\u001b[39mdebug(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mRe-raising status error\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m-> 1638\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_make_status_error_from_response(err\u001b[38;5;241m.\u001b[39mresponse) \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[1;32m   1640\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mawait\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_process_response(\n\u001b[1;32m   1641\u001b[0m     cast_to\u001b[38;5;241m=\u001b[39mcast_to,\n\u001b[1;32m   1642\u001b[0m     options\u001b[38;5;241m=\u001b[39moptions,\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m   1646\u001b[0m     retries_taken\u001b[38;5;241m=\u001b[39mretries_taken,\n\u001b[1;32m   1647\u001b[0m )\n",
      "\u001b[0;31mBadRequestError\u001b[0m: Error code: 400 - {'error': {'message': \"This model's maximum context length is 16385 tokens. However, your messages resulted in 36302 tokens. Please reduce the length of the messages.\", 'type': 'invalid_request_error', 'param': 'messages', 'code': 'context_length_exceeded'}}"
     ]
    }
   ],
   "source": [
    "# Ask a question  (feel free to change the question) \n",
    "question = \"In which episode was Viserys Targaryen killed?\"\n",
    "\n",
    "def ask_question(driver, question, model):\n",
    "    nest_asyncio.apply()\n",
    "\n",
    "    # Load .env file\n",
    "    load_dotenv()\n",
    "    os.environ[\"TOKENIZERS_PARALLELISM\"] = \"false\"\n",
    "\n",
    "    client = AsyncOpenAI()\n",
    "\n",
    "    # Key information from the question \n",
    "    prompt = question_prompt(question)\n",
    "    response = asyncio.run(get_response(client, prompt))\n",
    "    print(response)\n",
    "    key_information = response.split(\"Key Information: \")[1].strip()\n",
    "\n",
    "    # Compute the embedding for the key information\n",
    "    question_embedding = model.encode(key_information)\n",
    "\n",
    "    # Find the most similar node to the question embedding\n",
    "    node = find_most_similar_node(driver, question_embedding)\n",
    "    if node:\n",
    "        print(\"The most similar node is:\")\n",
    "        print(node)\n",
    "\n",
    "    # Get the relevant data based on the most similar node\n",
    "    relevant_data = get_relevant_data(driver, node, hops=2)\n",
    "\n",
    "    # Show the relevant data\n",
    "    print(\"The relevant data is:\")\n",
    "    print(relevant_data)\n",
    "\n",
    "    # LLM answers the question based on the relevant data\n",
    "    prompt = RAG_prompt(question, relevant_data)\n",
    "    response = asyncio.run(get_response(client, prompt))\n",
    "    print(\"The response is:\")\n",
    "    print(response)\n",
    "\n",
    "ask_question(driver, question, model)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "Here are a few examples of questions and answers: \n",
    "\n",
    "**To whom was Viserys Targaryen loyal to?**\n",
    "\n",
    "The response is:\n",
    "\n",
    ">Based on the provided data, Viserys Targaryen was loyal to House Targaryen.\n",
    ">This information is derived from the relationships indicating that Viserys\n",
    ">Targaryen was loyal to House Targaryen and the connections between them\n",
    "\n",
    "**Who killed Viserys Targaryen in Game of thrones?**\n",
    "\n",
    "The response is:\n",
    "\n",
    ">Based on the provided relevance expansion data, Khal Drogo killed Viserys\n",
    ">Targaryen in \"Game of Thrones.\" This information is inferred from the\n",
    ">relationship where Khal Drogo is linked to Viserys Targaryen with the action of\n",
    ">being \"KILLED\" by Khal Drogo. The data does not show any other character\n",
    ">directly killing Viserys Targaryen.\n",
    "\n",
    "**\"What was the weapon used to kill Viserys Targaryen in Game of Thrones?\"**\n",
    "\n",
    "The response is: \n",
    "\n",
    ">Based on the provided data, the weapon used to kill Viserys Targaryen in Game\n",
    ">of Thrones was not explicitly mentioned. The data only shows that Khal Drogo\n",
    ">was involved in the killing of Viserys Targaryen. There is no specific mention\n",
    ">of the weapon used in the relevance expansion data. Therefore, I do not have\n",
    ">enough information to answer the question about the weapon used to kill Viserys\n",
    ">Targaryen.\n",
    "\n",
    "This response is wrong, there is a method mentioned, not weapon, but LLM didn't catch the context due to different naming. \n",
    "\n",
    "**\"Who betrayed Viserys Targaryen in Game of Thrones?\"**\n",
    "\n",
    "The response is:\n",
    "\n",
    ">Based on the provided data, Khal Drogo betrayed Viserys Targaryen in Game of\n",
    ">Thrones by killing him. This conclusion is drawn from the relationship between\n",
    ">Khal Drogo and Viserys Targaryen where it is stated that Khal Drogo killed\n",
    ">Viserys Targaryen.\n",
    "\n",
    "This response is based on the killing relationship, but betrayal could have different consequences. \n",
    "\n",
    "Let's expand this knowledge. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Expanding the knowledge\n",
    "\n",
    "Let's say that now we want to expand our existing knowledge graph with\n",
    "additional information to enrich the dataset, provide more context and retrieve\n",
    "more relevant data. \n",
    "\n",
    "In this example, we will take unstructured data, such as the\n",
    "character description summary provided below, extract entities from that\n",
    "summary, generate triplets to build the knowledge graph create queries and\n",
    "eventually execute those queries in Memgraph to incorporate with the existing\n",
    "graph. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Sample text summary for processing\n",
    "summary = \"\"\"\n",
    "    Viserys Targaryen is the last living son of the former king, Aerys II Targaryen (the 'Mad King').\n",
    "    As one of the last known Targaryen heirs, Viserys Targaryen is obsessed with reclaiming the Iron Throne and \n",
    "    restoring his familys rule over Westeros. Ambitious and arrogant, he often treats his younger sister, Daenerys Targaryen, \n",
    "    as a pawn, seeing her only as a means to gain power. His ruthless ambition leads him to make a marriage alliance with \n",
    "    Khal Drogo, a powerful Dothraki warlord, hoping Khal Drogo will give him the army he needs. \n",
    "    However, Viserys Targaryens impatience and disrespect toward the Dothraki culture lead to his downfall;\n",
    "    he is ultimately killed by Khal Drogo in a brutal display of 'a crown for a king'  having molten gold poured over his head. \n",
    "    \"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Entity extraction\n",
    "\n",
    "TODO: add links \n",
    "\n",
    "The first step in the process is to extract entities from the summary using\n",
    "SpaCys LLM.\n",
    "\n",
    "To begin, we need to install SpaCy and the specific model we wll be using."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: spacy in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (3.8.2)\n",
      "Requirement already satisfied: spacy-legacy<3.1.0,>=3.0.11 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (3.0.12)\n",
      "Requirement already satisfied: spacy-loggers<2.0.0,>=1.0.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (1.0.5)\n",
      "Requirement already satisfied: murmurhash<1.1.0,>=0.28.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (1.0.11)\n",
      "Requirement already satisfied: cymem<2.1.0,>=2.0.2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (2.0.10)\n",
      "Requirement already satisfied: preshed<3.1.0,>=3.0.2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (3.0.9)\n",
      "Requirement already satisfied: thinc<8.4.0,>=8.3.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (8.3.2)\n",
      "Requirement already satisfied: wasabi<1.2.0,>=0.9.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (1.1.3)\n",
      "Requirement already satisfied: srsly<3.0.0,>=2.4.3 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (2.4.8)\n",
      "Requirement already satisfied: catalogue<2.1.0,>=2.0.6 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (2.0.10)\n",
      "Requirement already satisfied: weasel<0.5.0,>=0.1.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (0.4.1)\n",
      "Requirement already satisfied: typer<1.0.0,>=0.3.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (0.15.0)\n",
      "Requirement already satisfied: tqdm<5.0.0,>=4.38.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (4.67.1)\n",
      "Requirement already satisfied: requests<3.0.0,>=2.13.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (2.32.3)\n",
      "Requirement already satisfied: pydantic!=1.8,!=1.8.1,<3.0.0,>=1.7.4 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (2.10.3)\n",
      "Requirement already satisfied: jinja2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (3.1.4)\n",
      "Requirement already satisfied: setuptools in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (75.6.0)\n",
      "Requirement already satisfied: packaging>=20.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (24.2)\n",
      "Requirement already satisfied: langcodes<4.0.0,>=3.2.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (3.5.0)\n",
      "Requirement already satisfied: numpy>=1.19.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy) (2.0.2)\n",
      "Requirement already satisfied: language-data>=1.2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from langcodes<4.0.0,>=3.2.0->spacy) (1.3.0)\n",
      "Requirement already satisfied: annotated-types>=0.6.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from pydantic!=1.8,!=1.8.1,<3.0.0,>=1.7.4->spacy) (0.7.0)\n",
      "Requirement already satisfied: pydantic-core==2.27.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from pydantic!=1.8,!=1.8.1,<3.0.0,>=1.7.4->spacy) (2.27.1)\n",
      "Requirement already satisfied: typing-extensions>=4.12.2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from pydantic!=1.8,!=1.8.1,<3.0.0,>=1.7.4->spacy) (4.12.2)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests<3.0.0,>=2.13.0->spacy) (3.4.0)\n",
      "Requirement already satisfied: idna<4,>=2.5 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests<3.0.0,>=2.13.0->spacy) (3.10)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests<3.0.0,>=2.13.0->spacy) (2.2.3)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests<3.0.0,>=2.13.0->spacy) (2024.8.30)\n",
      "Requirement already satisfied: blis<1.1.0,>=1.0.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from thinc<8.4.0,>=8.3.0->spacy) (1.0.1)\n",
      "Requirement already satisfied: confection<1.0.0,>=0.0.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from thinc<8.4.0,>=8.3.0->spacy) (0.1.5)\n",
      "Requirement already satisfied: click>=8.0.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from typer<1.0.0,>=0.3.0->spacy) (8.1.7)\n",
      "Requirement already satisfied: shellingham>=1.3.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from typer<1.0.0,>=0.3.0->spacy) (1.5.4)\n",
      "Requirement already satisfied: rich>=10.11.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from typer<1.0.0,>=0.3.0->spacy) (13.9.4)\n",
      "Requirement already satisfied: cloudpathlib<1.0.0,>=0.7.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from weasel<0.5.0,>=0.1.0->spacy) (0.20.0)\n",
      "Requirement already satisfied: smart-open<8.0.0,>=5.2.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from weasel<0.5.0,>=0.1.0->spacy) (7.0.5)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from jinja2->spacy) (3.0.2)\n",
      "Requirement already satisfied: marisa-trie>=1.1.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from language-data>=1.2->langcodes<4.0.0,>=3.2.0->spacy) (1.2.1)\n",
      "Requirement already satisfied: markdown-it-py>=2.2.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from rich>=10.11.0->typer<1.0.0,>=0.3.0->spacy) (3.0.0)\n",
      "Requirement already satisfied: pygments<3.0.0,>=2.13.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from rich>=10.11.0->typer<1.0.0,>=0.3.0->spacy) (2.18.0)\n",
      "Requirement already satisfied: wrapt in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from smart-open<8.0.0,>=5.2.1->weasel<0.5.0,>=0.1.0->spacy) (1.17.0)\n",
      "Requirement already satisfied: mdurl~=0.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from markdown-it-py>=2.2.0->rich>=10.11.0->typer<1.0.0,>=0.3.0->spacy) (0.1.2)\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: spacy_llm in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (0.7.2)\n",
      "Requirement already satisfied: spacy<4.0,>=3.5 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy_llm) (3.8.2)\n",
      "Requirement already satisfied: jinja2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy_llm) (3.1.4)\n",
      "Requirement already satisfied: confection<1.0.0,>=0.1.3 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy_llm) (0.1.5)\n",
      "Requirement already satisfied: pydantic!=1.8,!=1.8.1,<3.0.0,>=1.7.4 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from confection<1.0.0,>=0.1.3->spacy_llm) (2.10.3)\n",
      "Requirement already satisfied: srsly<3.0.0,>=2.4.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from confection<1.0.0,>=0.1.3->spacy_llm) (2.4.8)\n",
      "Requirement already satisfied: spacy-legacy<3.1.0,>=3.0.11 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (3.0.12)\n",
      "Requirement already satisfied: spacy-loggers<2.0.0,>=1.0.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (1.0.5)\n",
      "Requirement already satisfied: murmurhash<1.1.0,>=0.28.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (1.0.11)\n",
      "Requirement already satisfied: cymem<2.1.0,>=2.0.2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (2.0.10)\n",
      "Requirement already satisfied: preshed<3.1.0,>=3.0.2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (3.0.9)\n",
      "Requirement already satisfied: thinc<8.4.0,>=8.3.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (8.3.2)\n",
      "Requirement already satisfied: wasabi<1.2.0,>=0.9.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (1.1.3)\n",
      "Requirement already satisfied: catalogue<2.1.0,>=2.0.6 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (2.0.10)\n",
      "Requirement already satisfied: weasel<0.5.0,>=0.1.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (0.4.1)\n",
      "Requirement already satisfied: typer<1.0.0,>=0.3.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (0.15.0)\n",
      "Requirement already satisfied: tqdm<5.0.0,>=4.38.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (4.67.1)\n",
      "Requirement already satisfied: requests<3.0.0,>=2.13.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (2.32.3)\n",
      "Requirement already satisfied: setuptools in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (75.6.0)\n",
      "Requirement already satisfied: packaging>=20.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (24.2)\n",
      "Requirement already satisfied: langcodes<4.0.0,>=3.2.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (3.5.0)\n",
      "Requirement already satisfied: numpy>=1.19.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from spacy<4.0,>=3.5->spacy_llm) (2.0.2)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from jinja2->spacy_llm) (3.0.2)\n",
      "Requirement already satisfied: language-data>=1.2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from langcodes<4.0.0,>=3.2.0->spacy<4.0,>=3.5->spacy_llm) (1.3.0)\n",
      "Requirement already satisfied: annotated-types>=0.6.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from pydantic!=1.8,!=1.8.1,<3.0.0,>=1.7.4->confection<1.0.0,>=0.1.3->spacy_llm) (0.7.0)\n",
      "Requirement already satisfied: pydantic-core==2.27.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from pydantic!=1.8,!=1.8.1,<3.0.0,>=1.7.4->confection<1.0.0,>=0.1.3->spacy_llm) (2.27.1)\n",
      "Requirement already satisfied: typing-extensions>=4.12.2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from pydantic!=1.8,!=1.8.1,<3.0.0,>=1.7.4->confection<1.0.0,>=0.1.3->spacy_llm) (4.12.2)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests<3.0.0,>=2.13.0->spacy<4.0,>=3.5->spacy_llm) (3.4.0)\n",
      "Requirement already satisfied: idna<4,>=2.5 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests<3.0.0,>=2.13.0->spacy<4.0,>=3.5->spacy_llm) (3.10)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests<3.0.0,>=2.13.0->spacy<4.0,>=3.5->spacy_llm) (2.2.3)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from requests<3.0.0,>=2.13.0->spacy<4.0,>=3.5->spacy_llm) (2024.8.30)\n",
      "Requirement already satisfied: blis<1.1.0,>=1.0.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from thinc<8.4.0,>=8.3.0->spacy<4.0,>=3.5->spacy_llm) (1.0.1)\n",
      "Requirement already satisfied: click>=8.0.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from typer<1.0.0,>=0.3.0->spacy<4.0,>=3.5->spacy_llm) (8.1.7)\n",
      "Requirement already satisfied: shellingham>=1.3.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from typer<1.0.0,>=0.3.0->spacy<4.0,>=3.5->spacy_llm) (1.5.4)\n",
      "Requirement already satisfied: rich>=10.11.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from typer<1.0.0,>=0.3.0->spacy<4.0,>=3.5->spacy_llm) (13.9.4)\n",
      "Requirement already satisfied: cloudpathlib<1.0.0,>=0.7.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from weasel<0.5.0,>=0.1.0->spacy<4.0,>=3.5->spacy_llm) (0.20.0)\n",
      "Requirement already satisfied: smart-open<8.0.0,>=5.2.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from weasel<0.5.0,>=0.1.0->spacy<4.0,>=3.5->spacy_llm) (7.0.5)\n",
      "Requirement already satisfied: marisa-trie>=1.1.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from language-data>=1.2->langcodes<4.0.0,>=3.2.0->spacy<4.0,>=3.5->spacy_llm) (1.2.1)\n",
      "Requirement already satisfied: markdown-it-py>=2.2.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from rich>=10.11.0->typer<1.0.0,>=0.3.0->spacy<4.0,>=3.5->spacy_llm) (3.0.0)\n",
      "Requirement already satisfied: pygments<3.0.0,>=2.13.0 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from rich>=10.11.0->typer<1.0.0,>=0.3.0->spacy<4.0,>=3.5->spacy_llm) (2.18.0)\n",
      "Requirement already satisfied: wrapt in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from smart-open<8.0.0,>=5.2.1->weasel<0.5.0,>=0.1.0->spacy<4.0,>=3.5->spacy_llm) (1.17.0)\n",
      "Requirement already satisfied: mdurl~=0.1 in /Users/antejavor/repos/jupyter-memgraph-tutorials/.venv/lib/python3.12/site-packages (from markdown-it-py>=2.2.0->rich>=10.11.0->typer<1.0.0,>=0.3.0->spacy<4.0,>=3.5->spacy_llm) (0.1.2)\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Collecting en-core-web-md==3.8.0\n",
      "  Downloading https://github.com/explosion/spacy-models/releases/download/en_core_web_md-3.8.0/en_core_web_md-3.8.0-py3-none-any.whl (33.5 MB)\n",
      "\u001b[2K     \u001b[90m\u001b[0m \u001b[32m33.5/33.5 MB\u001b[0m \u001b[31m92.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25h\u001b[38;5;2m Download and installation successful\u001b[0m\n",
      "You can now load the package via spacy.load('en_core_web_md')\n"
     ]
    }
   ],
   "source": [
    "%pip install spacy\n",
    "%pip install spacy_llm\n",
    "!python -m spacy download en_core_web_md"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The goal of extracting entities from the text is to preprocess the data before\n",
    "sending it to the GPT model, ensuring more accurate and relevant results. By\n",
    "using SpaCy, we can identify key entities such as characters and locations\n",
    "for a better understanding of the context of the text.\n",
    "\n",
    "This is particularly useful because SpaCy is specifically trained to recognize\n",
    "linguistic patterns and relationships in text, which helps to isolate and\n",
    "highlight the most important pieces of information. By preprocessing the text\n",
    "this way, we ensure that the GPT model receives a more structured input, helps\n",
    "reduce noise and irrelevant data, leading to more precise and context-aware\n",
    "outputs. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import spacy\n",
    "from spacy_llm.util import assemble\n",
    "import json\n",
    "from collections import Counter\n",
    "from pathlib import Path\n",
    "\n",
    "# Split document into sentences\n",
    "def split_document_sent(text, nlp):\n",
    "    doc = nlp(text)\n",
    "    return [sent.text.strip() for sent in doc.sents]\n",
    "\n",
    "\n",
    "def process_text(text, nlp, verbose=False):\n",
    "    doc = nlp(text)\n",
    "    if verbose:\n",
    "        print(f\"Text: {doc.text}\")\n",
    "        print(f\"Entities: {[(ent.text, ent.label_) for ent in doc.ents]}\")\n",
    "    return doc\n",
    "\n",
    "\n",
    "# Pipeline to run entity extraction\n",
    "def extract_entities(text, nlp, verbose=False):\n",
    "    processed_data = []\n",
    "    entity_counts = Counter()\n",
    "\n",
    "    sentences = split_document_sent(text, nlp)\n",
    "    for sent in sentences:\n",
    "        doc = process_text(sent, nlp, verbose)\n",
    "        entities = [(ent.text, ent.label_) for ent in doc.ents]\n",
    "\n",
    "        # Store processed data for each sentence\n",
    "        processed_data.append({\"text\": doc.text, \"entities\": entities})\n",
    "\n",
    "        # Update counters\n",
    "        entity_counts.update([ent[1] for ent in entities])\n",
    "\n",
    "    # Export to JSON\n",
    "    with open(\"processed_data.json\", \"w\") as f:\n",
    "        json.dump(processed_data, f)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Extract node and relationship parameters\n",
    "\n",
    "Now that we have extracted entities from the text, we have a better\n",
    "understanding of the data and a more structured context to send to GPT model\n",
    "we'll be using. The next step is to provide the extracted JSON file to the GPT\n",
    "prompt, along with clear instructions on how to extract nodes and relationships\n",
    "from those entities. These instructions will guide the model in identifying key\n",
    "connections between the entities, which can then be used to build a knowledge\n",
    "graph. In this example, we will be using the GPT-4 model. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Error executing query: \n",
      "        MERGE (n:Character:Entity {name: 'Viserys Targaryen'}) \n",
      "        ON CREATE SET n.id=n1 \n",
      "        ON MATCH SET n.id=n1\n",
      "        . Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n1.}\n",
      "Error executing query: \n",
      "        MERGE (n:Character:Entity {name: 'Aerys II Targaryen'}) \n",
      "        ON CREATE SET n.id=n2 \n",
      "        ON MATCH SET n.id=n2\n",
      "        . Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n2.}\n",
      "Error executing query: \n",
      "        MERGE (n:Title:Entity {name: 'Targaryen'}) \n",
      "        ON CREATE SET n.id=n3 \n",
      "        ON MATCH SET n.id=n3\n",
      "        . Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n3.}\n",
      "Error executing query: \n",
      "        MERGE (n:Title:Entity {name: 'the Iron Throne'}) \n",
      "        ON CREATE SET n.id=n4 \n",
      "        ON MATCH SET n.id=n4\n",
      "        . Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n4.}\n",
      "Error executing query: \n",
      "        MERGE (n:Location:Entity {name: 'Westeros'}) \n",
      "        ON CREATE SET n.id=n5 \n",
      "        ON MATCH SET n.id=n5\n",
      "        . Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n5.}\n",
      "Error executing query: \n",
      "        MERGE (n:Character:Entity {name: 'Daenerys Targaryen'}) \n",
      "        ON CREATE SET n.id=n6 \n",
      "        ON MATCH SET n.id=n6\n",
      "        . Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n6.}\n",
      "Error executing query: \n",
      "        MERGE (n:Character:Entity {name: 'Khal Drogo'}) \n",
      "        ON CREATE SET n.id=n7 \n",
      "        ON MATCH SET n.id=n7\n",
      "        . Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n7.}\n",
      "Error executing query: \n",
      "        MERGE (n:House:Entity {name: 'Dothraki'}) \n",
      "        ON CREATE SET n.id=n8 \n",
      "        ON MATCH SET n.id=n8\n",
      "        . Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n8.}\n",
      "Error executing query: MATCH (a {id: n1}), (b {id: n2}) CREATE (a)-[:PARENT_OF]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n1.}\n",
      "Error executing query: MATCH (a {id: n1}), (b {id: n3}) CREATE (a)-[:SIBLING_OF]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n1.}\n",
      "Error executing query: MATCH (a {id: n1}), (b {id: n4}) CREATE (a)-[:HAPPENED_IN]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n1.}\n",
      "Error executing query: MATCH (a {id: n1}), (b {id: n5}) CREATE (a)-[:RULES]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n1.}\n",
      "Error executing query: MATCH (a {id: n1}), (b {id: n6}) CREATE (a)-[:SIBLING_OF]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n1.}\n",
      "Error executing query: MATCH (a {id: n6}), (b {id: n7}) CREATE (a)-[:MARRIED_TO]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n6.}\n",
      "Error executing query: MATCH (a {id: n7}), (b {id: n8}) CREATE (a)-[:LOYAL_TO]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n7.}\n",
      "Error executing query: MATCH (a {id: n7}), (b {id: n8}) CREATE (a)-[:RULES]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n7.}\n",
      "Error executing query: MATCH (a {id: n7}), (b {id: n1}) CREATE (a)-[:BETRAYED_BY]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n7.}\n",
      "Error executing query: MATCH (a {id: n7}), (b {id: n1}) CREATE (a)-[:KILLED]->(b). Error: {code: Memgraph.ClientError.MemgraphError.MemgraphError} {message: Unbound variable: n7.}\n"
     ]
    }
   ],
   "source": [
    "    \n",
    "def enrich_graph_data(driver, summary, nlp):\n",
    "    nest_asyncio.apply()\n",
    "    \n",
    "    load_dotenv()\n",
    "    os.environ[\"TOKENIZERS_PARALLELISM\"] = \"false\"\n",
    "\n",
    "    client = AsyncOpenAI()\n",
    "\n",
    "    # Load the spaCy model\n",
    "    nlp = spacy.load(\"en_core_web_md\")\n",
    "\n",
    "    # Sample text summary for processing\n",
    "    summary = \"\"\"\n",
    "        Viserys Targaryen is the last living son of the former king, Aerys II Targaryen (the 'Mad King').\n",
    "        As one of the last known Targaryen heirs, Viserys Targaryen is obsessed with reclaiming the Iron Throne and \n",
    "        restoring his familys rule over Westeros. Ambitious and arrogant, he often treats his younger sister, Daenerys Targaryen, \n",
    "        as a pawn, seeing her only as a means to gain power. His ruthless ambition leads him to make a marriage alliance with \n",
    "        Khal Drogo, a powerful Dothraki warlord, hoping Khal Drogo will give him the army he needs. \n",
    "        However, Viserys Targaryens impatience and disrespect toward the Dothraki culture lead to his downfall;\n",
    "        he is ultimately killed by Khal Drogo in a brutal display of 'a crown for a king'  having molten gold poured over his head. \n",
    "    \"\"\"\n",
    "\n",
    "    extract_entities(summary, nlp)\n",
    "\n",
    "    # Load processed data from JSON\n",
    "    json_path = Path(\"processed_data.json\")\n",
    "    with open(json_path, \"r\") as f:\n",
    "        processed_data = json.load(f)\n",
    "\n",
    "    # Prepare nodes and relationships\n",
    "    nodes = []\n",
    "    relationships = []\n",
    "\n",
    "    # Formulate a prompt for GPT-4\n",
    "    prompt = (\n",
    "        \"Extract entities and relationships from the following JSON data. For each entry in data['entities'], \"\n",
    "        \"create a 'node' dictionary with fields 'id' (unique identifier), 'name' (entity text), and 'type' (entity label). \"\n",
    "        \"For entities that have meaningful connections, define 'relationships' as dictionaries with 'source' (source node id), \"\n",
    "        \"'target' (target node id), and 'relationship' (type of connection). Create max 30 nodes, format relationships in the format of capital letters and _ inbetween words and format the entire response in the JSON output containing only variables nodes and relationships without any text inbetween. Use following labels for nodes: Character, Title, Location, House, Death, Event, Allegiance and following relationship types: HAPPENED_IN, SIBLING_OF, PARENT_OF, MARRIED_TO, HEALED_BY, RULES, KILLED, LOYAL_TO, BETRAYED_BY. Make sure the entire JSON file fits in the output\"\n",
    "        \"JSON data:\\n\"\n",
    "        f\"{json.dumps(processed_data)}\"\n",
    "    )\n",
    "\n",
    "    response = asyncio.run(get_response(client, prompt))\n",
    "\n",
    "    structured_data = json.loads(response)  # Assuming GPT-4 outputs structured JSON\n",
    "\n",
    "    # Populate nodes and relationships lists\n",
    "    nodes.extend(structured_data.get(\"nodes\", []))\n",
    "    relationships.extend(structured_data.get(\"relationships\", []))\n",
    "\n",
    "    cypher_queries = generate_cypher_queries(nodes, relationships)\n",
    "    with driver.session() as session:\n",
    "        for query in cypher_queries:\n",
    "            try:\n",
    "                session.run(query)\n",
    "                print(f\"Executed query: {query}\")\n",
    "            except Exception as e:\n",
    "                print(f\"Error executing query: {query}. Error: {e}\")\n",
    "\n",
    "\n",
    "enrich_graph_data(driver, summary, nlp)\n",
    "\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Generate queries\n",
    "\n",
    "Now that GPT has provided us with the structured data for the nodes and\n",
    "relationships, the next step is to generate the Cypher queries that we will use\n",
    "to execute in Memgraph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_cypher_queries(nodes, relationships):\n",
    "    queries = []\n",
    "\n",
    "    # Create nodes\n",
    "    for node in nodes:\n",
    "        query = f\"\"\"\n",
    "        MERGE (n:{node['type']}:Entity {{name: '{node['name']}'}}) \n",
    "        ON CREATE SET n.id={node['id']} \n",
    "        ON MATCH SET n.id={node['id']}\n",
    "        \"\"\"\n",
    "        queries.append(query)\n",
    "\n",
    "    # Create relationships\n",
    "    for rel in relationships:\n",
    "        query = f\"MATCH (a {{id: {rel['source']}}}), (b {{id: {rel['target']}}}) \" \\\n",
    "                f\"CREATE (a)-[:{rel['relationship']}]->(b)\"\n",
    "        queries.append(query)\n",
    "\n",
    "    return queries\n",
    "\n",
    "cypher_queries = generate_cypher_queries(nodes, relationships)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Execute queries\n",
    "\n",
    "The final step is to execute those queries in Memgraph, enriching your graph\n",
    "with the newly created context. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    for query in cypher_queries:\n",
    "        try:\n",
    "            session.run(query)\n",
    "            print(f\"Executed query: {query}\")\n",
    "        except Exception as e:\n",
    "            print(f\"Error executing query: {query}. Error: {e}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The dataset now has additional knowledge: "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "vscode": {
     "languageId": "sql"
    }
   },
   "source": [
    "```\n",
    "MATCH (a {id: 1}), (b {id: 2}) CREATE (a)-[:PARENT_OF]->(b)\n",
    "MATCH (a {id: 1}), (b {id: 3}) CREATE (a)-[:SIBLING_OF]->(b)\n",
    "MATCH (a {id: 1}), (b {id: 4}) CREATE (a)-[:LOYAL_TO]->(b)\n",
    "MATCH (a {id: 1}), (b {id: 5}) CREATE (a)-[:HAPPENED_IN]->(b)\n",
    "MATCH (a {id: 1}), (b {id: 6}) CREATE (a)-[:HAPPENED_IN]->(b)\n",
    "MATCH (a {id: 1}), (b {id: 7}) CREATE (a)-[:SIBLING_OF]->(b)\n",
    "MATCH (a {id: 1}), (b {id: 8}) CREATE (a)-[:MARRIED_TO]->(b)\n",
    "MATCH (a {id: 1}), (b {id: 9}) CREATE (a)-[:HEALED_BY]->(b)\n",
    "MATCH (a {id: 8}), (b {id: 9}) CREATE (a)-[:RULES]->(b)\n",
    "MATCH (a {id: 8}), (b {id: 1}) CREATE (a)-[:BETRAYED_BY]->(b)\n",
    "\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As described earlier, before enriching the graph with more data: \n",
    "\n",
    "**\"Who betrayed Viserys Targaryen in Game of Thrones?\"**\n",
    "\n",
    "The response was:\n",
    "\n",
    ">Based on the provided data, Khal Drogo betrayed Viserys Targaryen in Game of\n",
    ">Thrones by killing him. This conclusion is drawn from the relationship between\n",
    ">Khal Drogo and Viserys Targaryen where it is stated that Khal Drogo killed\n",
    ">Viserys Targaryen.\n",
    "\n",
    "This response is based on the killing relationship, but betrayal could have\n",
    "different consequences. So in a sense LLM made that conclusion based on the\n",
    "wrong relationship. \n",
    "\n",
    "Now again asking the same question yields a correct answer: **\"Who betrayed\n",
    "Viserys Targaryen in Game of Thrones?\"**\n",
    "\n",
    ">Based on the provided data, Khal Drogo betrayed Viserys Targaryen in Game of\n",
    ">Thrones. This conclusion is derived from the relationship between Viserys\n",
    ">Targaryen and Khal Drogo, where Khal Drogo is connected to Viserys Targaryen\n",
    ">through the 'BETRAYED_BY' relationship, indicating that Khal Drogo betrayed\n",
    ">Viserys Targaryen.\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
